[
  {
    "Name": "Juwon Isola-Osobu",
    "Slug": "adejuwon-isola-osobu",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "6185a02e0800222e03ce1ceb",
    "Created On": "Fri Nov 05 2021 21:20:46 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sat Nov 13 2021 00:31:35 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sat Nov 13 2021 00:31:38 GMT+0000 (Coordinated Universal Time)",
    "Group": "Team",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/6186a5f32c898c0f9ded1728_Juwon.jpg",
    "Job Title": "Director of Program Management",
    "Card Text": "I love our mission because it helps both our participants and the companies. Diverse ideas and perspectives ultimately lead to improved creativity and productivity.",
    "Bio Full": "Adejuwon has more than ten years of experience working in the technology industry in a variety of roles, including scrum master, program manager and CEO. Adejuwon has co-founded and exited two e-commerce businesses: Jay Osbie, the first-of-its-kind celebrity merchandise program, and 1500naira deals, an online discount store. In his current role at Reskill Americans, he is responsible for all aspects of the program’s coordination, design, planning and governance.",
    "Personal Message": "As a serial entrepreneur, acquiring new technology skills has enabled me to launch my startups in Nigeria. I love our mission because it helps both our participants and the companies. Diverse ideas and perspectives ultimately lead to improved creativity and productivity. I’m excited to be a part of a company that is working to make this happen.",
    "Email": "",
    "LinkedIn": "in/juwon-io/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": "05"
  },
  {
    "Name": "Ashley Chapman",
    "Slug": "ashley-chapman",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "61859fb74e7a984998da4a47",
    "Created On": "Fri Nov 05 2021 21:18:47 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sat Nov 13 2021 00:35:20 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sat Nov 13 2021 00:35:29 GMT+0000 (Coordinated Universal Time)",
    "Group": "Team",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/6185a6b1fac45517143fadfb_Ashley.jpg",
    "Job Title": "Director, Marketing and Communications",
    "Card Text": "I joined Reskill Americans because I want to help dismantle barriers to access in the tech industry.",
    "Bio Full": "Ashley’s background includes more than 20 years of experience managing global communications in the public and private sectors. She has also served as a speechwriter for leaders of government, Fortune 500 companies and nonprofits. Ashley is a speaker coach with TEDxSeattle, and a speaker coach and mentor for TEDxYouth@Seattle, where she helps empower youth to share their ideas on the TEDx stage. In her role at Reskill Americans, Ashley provides strategic communications counsel, including overseeing all content creation and brand messaging for the organization.",
    "Personal Message": "I joined Reskill Americans because I want to help dismantle barriers to access in the tech industry. Our participants are driven, entrepreneurial  professionals who commit to our rigorous program despite busy schedules which include school and full-time jobs. I am incredibly inspired by their determination to start new careers in the industry. I’m excited to be part of the team that is helping them reach their goals.",
    "Email": "",
    "LinkedIn": "in/ashleylchapman/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": "04"
  },
  {
    "Name": "Bambo Sofola",
    "Slug": "bambo-sofola",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "61871a841368e6c79dc5515b",
    "Created On": "Sun Nov 07 2021 00:15:00 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Nov 07 2021 00:15:00 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Advisor",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/61871a496a5eb6d80c396fb0_Bambo.jpg",
    "Job Title": "General Manager, Microsoft",
    "Card Text": "Providing access to an education in technology can transform lives, and I joined the Advisory Board of Reskill Americans because I want to help give underrepresented minorities the opportunity to start exciting and fulfilling careers in technology.",
    "Bio Full": "Bambo Sofola is a General Manager of Azure Global Emerging Markets where he leads a team that helps industries and communities realize their full potential through game changing innovation and accelerated technology. Bambo started his career at Microsoft as Director of Quality Engineering in Windows and Windows Embedded Operating Systems. Over the next 28 years, he has helped engineer solutions, cultivate talent, and foster partnerships in various leadership roles, including serving as General Manager of Gaming in global emerging markets. Bambo has also worked on a variety of Microsoft projects that give back to the global community, including most recently a Microsoft/UNICEF global learning platform that helps address the Covid-19 education crisis. Bambo also serves on the Board of Directors for Block By Block Foundation, which empowers communities to transform neglected urban space into vibrant spaces that improve quality of life.",
    "Personal Message": "My passion for electronics began as a child, and since then, I’ve devoted my career to empowering technologists and entrepreneurs globally. Providing access to an education in technology can transform lives, and I joined the Advisory Board of Reskill Americans because I want to help give underrepresented minorities the opportunity to start exciting and fulfilling careers in technology.",
    "Email": "",
    "LinkedIn": "",
    "Twitter": "",
    "Instagram": "",
    "Ordering": ""
  },
  {
    "Name": "David Fowler",
    "Slug": "david-fowler",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "618718e580976a1623f4e96c",
    "Created On": "Sun Nov 07 2021 00:08:05 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Nov 07 2021 00:09:02 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Advisor",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/618718b291f90cf0f1647a73_david-fowler-linkedin-1.jpg",
    "Job Title": "Microsoft Software Architect",
    "Card Text": "Everyone can build a fulfilling career in tech if given the opportunity, and I want to make sure that more people that look like me have that opportunity.”",
    "Bio Full": "David Fowler is a Software Architect at Microsoft where his responsibilities include working on .NET and the Azure SignalR service, which is a scalable service for running web, mobile and IoT applications in the cloud. David started his career at Microsoft as an intern, and has over 13 years of experience working on developer frameworks and tools.",
    "Personal Message": "I grew up in the Caribbean and it wasn’t until I went to University in the U.S. that I realized there were very few African Americans in the Software Engineering/Computer Science/Tech industry. Everyone can build a fulfilling career in tech if given the opportunity, and I want to make sure that more people that look like me have that opportunity.",
    "Email": "",
    "LinkedIn": "in/davidfowl/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": "01"
  },
  {
    "Name": "David Ortiz",
    "Slug": "david-ortiz",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "618719f336ecec2a114e3c2f",
    "Created On": "Sun Nov 07 2021 00:12:35 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Nov 07 2021 00:12:35 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Advisor",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/618719c2fd9507e335808144_DavidJOrtiz%20(1).jpg",
    "Job Title": "CEO, SimWin Sports",
    "Card Text": "Reskill American’s unique and noble approach is refreshing, and I am sure it will be effective in changing the trajectory of many lives.”",
    "Bio Full": "David Ortiz joined the video game industry in 1996 and is an innovative executive with over two decades of global experience pioneering award-winning products in both the video game and real money gaming markets. David is currently CEO and Founder of SimWin Sports, a company focused on developing groundbreaking experiences at the intersection of fantasy sports, sports betting, and esports. While at EA Sports, David held a senior leadership role on the Madden NFL team and helped pioneer the Game Designer role for Microsoft, working on the NFL Fever franchise and helping launch the first ever title on the XBOX LIVE platform. David has also held director and senior executive roles at Sony and Warner Bros Games.",
    "Personal Message": "Tech provides an opportunity for creativity and ideas to reach masses and influence everything from how we work to how we are entertained. Having people from all backgrounds develop the skills to contribute to these creations will improve and enhance their quality and relatability. A career in tech can provide a livable wage, but it can also provide opportunities to earn generational wealth. I am committed to helping as many organizations as possible that want to make a real impact on diversity, equality, and inclusion. Reskill American’s unique and noble approach is refreshing, and I am sure it will be effective in changing the trajectory of many lives.",
    "Email": "",
    "LinkedIn": "",
    "Twitter": "",
    "Instagram": "",
    "Ordering": ""
  },
  {
    "Name": "Dr. Thelma Phillip-Browne",
    "Slug": "dr-thelma-phillip-browne",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "618712bb0941cd27ce8089c0",
    "Created On": "Sat Nov 06 2021 23:41:47 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Nov 07 2021 00:05:04 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Advisor",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/618712f35ece085b3d634965_Amb-Dr.-Thelma-Phillip-Browne.jpg",
    "Job Title": "Ambassador, St. Kitts and Nevis",
    "Card Text": "I have always been a proponent of education and embrace the 6 Cs of education: creativity, critical thinking, collaboration, connectivity, community, and culture.'",
    "Bio Full": "Ambassador Dr. Thelma Phillip-Browne is Ambassador Extraordinary and Plenipotentiary of St Kitts and Nevis, a post she has held since 2015. Prior to that, Dr. Phillip-Browne practiced for many years as a dermatologist and held various leadership roles in medicine, including serving as a Director of Primary Health Care and Chief Medical Officer. In 2011, Ambassador Phillip-Browne obtained a Master of Theological Science (MTS) degree and has served as a lay preacher in her local church. The proud mother of two daughters and one son and grandmother of two girls, Ambassador Phillip-Browne is a sports enthusiast and former national netball player.",
    "Personal Message": "I was born in a chattel house (a small moveable wooden house that existed in former British Caribbean island colonies) in a poor neighborhood, and learned that education is the avenue to exit poverty. I have always been a proponent of education and embrace the 6 Cs of education: creativity, critical thinking, collaboration, connectivity, community, and culture. I believe preparation for a career in tech embraces all of these crucial elements. I believe that every individual was imbued by the Creator with unique gifts that must be nurtured and nuanced for the benefit not just of that person but for the sustainability of man and his environment. Reskill Americans is an opportunity for people to bond together in the spirit of ubuntu to propel the world towards reducing inequality and promoting inclusive economic growth — two core goals of the Sustainable Development Goals 2030. It all starts with one person learning from another!",
    "Email": "",
    "LinkedIn": "",
    "Twitter": "",
    "Instagram": "",
    "Ordering": "01"
  },
  {
    "Name": "Femi Akinde",
    "Slug": "femi-akinde",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "61859b9480976a4439ee4959",
    "Created On": "Fri Nov 05 2021 21:01:08 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sat Nov 06 2021 23:45:54 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Team",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/6185a70ad7ddcb80f3751784_femi.jpg",
    "Job Title": "Co-Founder",
    "Card Text": "We want to live in a world where minority representation in the tech sector mirrors their percentage in the US population.",
    "Bio Full": "Femi Akinde is a Principal Program Manager for Azure Global at Microsoft, where he is part of the team extending Azure’s footprint around the globe. Femi is a former tech entrepreneur and product leader with extensive experience mobilizing teams to launch best-in-class solutions. In recognition of one of these solutions, Femi was selected as a TED Fellow — a program that selects 25 innovators globally each year — and gave a TED talk about it in 2011.",
    "Personal Message": "The events of 2020 amplified the inequity for black and brown people in our country on every level. I knew that I had to help address this socio-economic imbalance in some way. So, I created a workforce development solution to a tech industry problem. The problem? Tech companies are investing in diversifying their rapidly-growing workforce, but are hampered by small talent pools because existing intervention programs (coding boot camps) require prior coding knowledge or access to credit to pay for tuition. That means a majority of potential candidates can’t access software development training. The solution? Scale up tuition-free access to training for as many historically underrepresented racial minorities as possible and give tech companies multiple touch points to interact with them.\nWe want to live in a world where minority representation in the tech sector mirrors their percentage in the US population. We founded a software development reskilling nonprofit that enrolls thousands of underrepresented racial minorities and gives them an opportunity to start a tech career so we can live in that world.",
    "Email": "",
    "LinkedIn": "in/femiakinde/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": "01"
  },
  {
    "Name": "John \"JG\" Chirapurath",
    "Slug": "john-jg-chirapurath",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "6187199b47f9d2593e4fcb3c",
    "Created On": "Sun Nov 07 2021 00:11:07 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Thu Dec 02 2021 05:42:23 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Thu Dec 02 2021 05:42:25 GMT+0000 (Coordinated Universal Time)",
    "Group": "Advisor",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/6187195591f90c840c647a87_john-jg.jpg",
    "Job Title": "Chief Marketing & Solutions Officer, SAP",
    "Card Text": "I am inspired by the mission of Reskill Americans, and I want to play a part in helping aspiring tech professionals, especially historically underrepresented racial minorities, find a fulfilling career in the industry.",
    "Bio Full": "JG is Chief Marketing & Solutions Officer for the Business Technology Platform at SAP, where he partners with his team to continue to help customers in their digital transformation journeys. Prior to his current role, he served as Vice President of Azure Data, Artificial Intelligence & Edge at Microsoft, where he oversaw  Azure’s databases, blockchain, analytics, machine learning/AI, IoT and the mixed reality business. He has more than 20 years of experience in the tech industry: he has held senior roles at both Microsoft and Hewlett-Packard, and co-founded a technology firm, Sarvega, which was acquired by Intel and is now a case study at Harvard Business School. J.G. is passionate about developing talent, and coaching diverse individuals and teams.",
    "Personal Message": "As someone who has profoundly benefited from a career in technology, I am passionate about enabling the very same for others. I am inspired by the mission of Reskill Americans, and I want to play a part in helping aspiring tech professionals, especially historically underrepresented racial minorities, find a fulfilling career in the industry.",
    "Email": "",
    "LinkedIn": "in/chirapurath/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": ""
  },
  {
    "Name": "Mike Koss",
    "Slug": "mike-koss",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "61859f5208002217d7ce1731",
    "Created On": "Fri Nov 05 2021 21:17:06 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sat Nov 06 2021 23:46:28 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Team",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/6185a6d947f9d2dc8148a92f_mike.jpg",
    "Job Title": "Co-Founder/CTO",
    "Card Text": "I joined the board of Reskill Americans because I believe the fastest way to end the racial inequity in tech is to give everyone access to software development training.",
    "Bio Full": "Mike Koss started his career at Microsoft in 1983 as a software developer, and over the next 19 years played a pivotal role in some of Microsoft’s most iconic programs. He was a developer on the original Excel spreadsheet team, and later founded the development teams for Outlook and SharePoint. After Microsoft, Mike joined the Seattle startup community as an angel investor and served in tech leadership roles for a series of technology startups. Mike has been passionate about technology education and supporting the developer community, co-founding the Seattle Google Developer Group (GDG) and later building developer tools as a Staff Engineer at Google. Mike has been a board member at the Seattle Museum of Flight for more than 17 years, where he developed software for educational programs and now serves on both the Technology and Executive Committees. In his role as Chief Technical Officer for Reskill Americans, Mike focuses on curriculum development and the mentoring program.",
    "Personal Message": "I began my career in software development at the dawn of the personal computer industry. My coworkers were predominantly white males back then, and today, nearly 40 years later, it’s a shame that the demographics of the industry have barely shifted. I joined the board of Reskill Americans because I believe the fastest way to end the racial inequity in tech is to give everyone access to software development training. I’m excited to work with Reskill Americans to help people get the skills they need to build a career in one of the world’s fastest growing and most highly paid industries. I know a software development career is very rewarding and full of new challenges. It’s hard to think of another career where you get to be constantly learning and have as much fun!",
    "Email": "",
    "LinkedIn": "in/mckoss/",
    "Twitter": "mckoss",
    "Instagram": "mckoss/",
    "Ordering": "02"
  },
  {
    "Name": "Nick Tsilas",
    "Slug": "nick-tsilas",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "618717be72122d2770a144b9",
    "Created On": "Sun Nov 07 2021 00:03:10 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Nov 07 2021 00:08:39 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Advisor",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/618717719578c4a40db777f7_Nick-Tsilas.jpeg",
    "Job Title": "Microsoft Asst. General Counsel",
    "Card Text": "I’m passionate about Reskill American’s mission to level the playing field and provide opportunities to underrepresented minorities.",
    "Bio Full": "Nick is Assistant General Counsel for Microsoft’s Worldwide Commercial Business and leads a team responsible for the legal support for Microsoft’s automotive, manufacturing, energy, retail, telecommunications, and financial services priority industries. He works directly with customers, partners, and regulators on enterprise cloud services, with a focus on helping customers in their digital transformation journey. In his 20-year career at Microsoft, Nick has been General Manager of Microsoft’s National Technology Office in the Public Sector organization, Assistant General Counsel and Senior Director of Global Government Affairs, and Senior Attorney on the Corporate Standards Legal team. Before joining Microsoft, Nick practiced law at Willkie Farr & Gallagher in Washington, D.C. Prior to practicing law, Nick was an electrical engineer at Westinghouse Corporation. Nick was born in Athens, Greece and now resides in Seattle, Washington.",
    "Personal Message": "Equity and social justice are fundamental principles of our democracy. However, systemic racism and economic inequality have created real barriers and excluded minorities from opportunities, including educational and professional opportunities in tech. I’ve seen and benefited firsthand from the power of one student, one keyboard and lines of code that can change the world. I’m passionate about Reskill American’s mission to level the playing field and provide opportunities to underrepresented minorities. The next Bill Gates will be a minority. And if we’re a little lucky, who knows, they may even be someone that was motivated by Reskill Americans.",
    "Email": "",
    "LinkedIn": "in/ntsilas/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": 50
  },
  {
    "Name": "Pamela R. Price",
    "Slug": "pamela-r-price",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "6185a061cb39c1384f7a4a91",
    "Created On": "Fri Nov 05 2021 21:21:37 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sat Nov 06 2021 23:46:52 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Nov 07 2021 00:20:00 GMT+0000 (Coordinated Universal Time)",
    "Group": "Team",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/6185a5328f44eb53dc935481_pam.png",
    "Job Title": "Director of Education",
    "Card Text": "I believe in the power of education to change lives, and I am passionate about being a mentor and role model to show others what is possible. Together, we can change the future of tech.",
    "Bio Full": "Pamela Price is a passionate STEM educator who has worked for more two decades in academics and more than one decade in tech. After 15 years working at various Silicon Valley companies ranging from startups to multinationals, Pamela started a second career in teaching, helping students develop a strong foundation in programming concepts. For the last 20 years, she has worked as a Computer Science Professor at Mills College, College of San Mateo, Ohlone College, and DeVry University. Her expertise is teaching all levels of programming, in particular Java and C++. Most recently, Pamela founded Jumpstart Code, which develops YouTube content that makes complex coding concepts easy to understand. She has also worked with Girls Who Code as an instructor in their Summer Immersion Program. She loves to inspire the learning process and help students at all levels develop a love of coding. Her education includes a Bachelor of Science in Electrical Engineering from Rice University and a Master of Science in Electrical Engineering from Stanford University.",
    "Personal Message": "In order to create technology that benefits all people, we need a diversity of viewpoints in the tech industry. Throughout my education and career, I’ve often been the only minority and/or woman in the room. When I became a teacher, it bothered me that women and people of color continued to be underrepresented in the classroom. Typical academic paths and bootcamps haven’t always been open and accessible to underrepresented minorities and women. Reskill Americans is changing that. A background in technology can open doors to many careers, not just software development and coding. I believe in the power of education to change lives, and I am passionate about being a mentor and role model to show others what is possible. Together, we can change the future of tech. ",
    "Email": "",
    "LinkedIn": "in/pamelarprice/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": "03"
  },
  {
    "Name": "Tim Mallalieu",
    "Slug": "tim-mallalieu",
    "Collection ID": "61859b2c741a724232a192c0",
    "Item ID": "61871e88741a72d682a84895",
    "Created On": "Sun Nov 07 2021 00:32:08 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Fri Nov 12 2021 01:22:45 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Fri Nov 12 2021 01:22:48 GMT+0000 (Coordinated Universal Time)",
    "Group": "Advisor",
    "Profile Picture": "https://uploads-ssl.webflow.com/61461840db710410464596ec/61871e4b80976a1710f52875_timm.jpeg",
    "Job Title": "General Manager, Microsoft",
    "Card Text": "I truly believe that our training model could 'crack the code' on how to make software training accessible to anyone. My hope is that anyone who has a dream of working in technology will not only see that it is possible, but have confidence that one day, they can become role models for others.”",
    "Bio Full": "Tim Mallalieu is the General Manager of Architecture for Azure Global at Microsoft, where he supports technical initiatives and architectural efforts across Azure’s portfolio. He has more than 27 years of experience in the tech industry, including 18 years at Microsoft, where he has primarily worked in the areas of Azure and Big Data, as well as in roles at three startup companies. In 1994, Tim founded an offshore development company called Net.kn, in St Kitts in the Caribbean, which delivered a turn-key hosted internet casino offering.",
    "Personal Message": "I am mixed race: Black, White and Chinese, and I grew up in the Caribbean where educational opportunities were scarce. My mother was a teacher and my father was an electrical engineer; education was a priority to them. After graduating from college in the U.S., I returned to the Caribbean and was determined to help people in my community get ahead. So, I started a company that wrote software for internet casinos and e-commerce, and trained young talent who had no access to formal education but who had a passion for computers, programming or graphic design. Today, more than 20 years later, that initial team that I hired have all built successful careers in the tech industry.I joined the board of Reskill Americans because I want to give this same access – but on a much, much bigger scale – to our minority communities here in the U.S. I truly believe that our training model could “crack the code” on how to make software training accessible to anyone. My hope is that anyone who has a dream of working in technology will not only see that it is possible, but have confidence that one day, they can become role models for others.",
    "Email": "",
    "LinkedIn": "in/tim-mallalieu-b3578/",
    "Twitter": "",
    "Instagram": "",
    "Ordering": ""
  }
]
